* TODO with code

#+BEGIN_SRC python
  hostname = 'leaf1'
  management_ip = '192.168.25.201'
  system_mac_address = 'xx:xx:xx:xx:xx:xx'

  print(f'map {system_mac_address} to {hostname} then provide {management_ip}')
  print("map {} to {} then provide {}".format(system_mac_address, hostname, management_ip))
  print("map %s to %s then provide %s"%(system_mac_address, hostname, management_ip))

  return "map {} to {} then provide {}".format(system_mac_address, hostname, management_ip)
#+END_SRC

#+RESULTS:
: map xx:xx:xx:xx:xx:xx to leaf1 then provide 192.168.25.201

#+BEGIN_SRC python
  nd = [['xx', 'leaf1', '1.1'],
	['yy', 'leaf2', '2.2'],
	['zz', 'leaf3', '3.3']]
  return nd
#+END_SRC

#+RESULTS:
| xx | leaf1 | 1.1 |
| yy | leaf2 | 2.2 |
| zz | leaf3 | 3.3 |

#+BEGIN_SRC python
  kv = {1: [2, 3],
	5: [6, 7]}
  req = 1

  if kv.get(req):
      mc = req
      hn = kv[1][0]
      ip = kv[1][1]
      return "{} {} {}".format(mc, hn, ip)
#+END_SRC

#+RESULTS:
: 1 2 3

#+BEGIN_SRC python
  kv = {'aa': ['leaf1', '1.1'],
	'bb': ['leaf2', '2.2']}

  req = 'aa'

  if kv.get(req):
      mc = req
      hn = kv[req][0]
      ip = kv[req][1]
      output = "map mac address '{}' to hostname '{}' then provide ip '{}'".format(mc, hn, ip)
      print(output)

  return output
#+END_SRC

#+RESULTS:
: map mac address 'aa' to hostname 'leaf1' then provide ip '1.1'

#+BEGIN_SRC python
  network_device = {'aa:bb:cc': ['leaf1', '1.1'],
		    'bb:cc:dd': ['leaf2', '2.2']}

  request = 'bb:cc:dd'

  def lookup(mac_address):
      if network_device.get(mac_address):
	  hostname = network_device[mac_address][0]
	  ip = network_device[mac_address][1]
	  output = "map '{}' to hostname '{}' then provide management ip to '{}'".format(mac_address, hostname, ip)
	  return output

  print(lookup(request))
#+END_SRC

#+RESULTS:
